from string import Template

system_prompt = """
أنت مساعد يستجيب لاستفسارات المستخدمين.

سيتم تزويدك بوثائق مرتبطة باستفسار المستخدم.

قم بإنشاء رد باستخدام الوثائق المقدمة، وإذا كانت الوثائق غير ذات صلة فتجاهلها.

إذا لم تكن هناك وثائق كافية، فاعتذر للمستخدم وأخبره بأن الوثائق المتاحة لا تحتوي على إجابة لاستفساره.

إذا لم تتمكن من إنشاء رد لأي سبب آخر، فاعتذر أيضًا.

كن ودودًا، وأجب بدقة، ولا تقدم أي معلومات غير مفيدة.

قم بالرد بنفس لغة الاستفسار المقدم.
"""

document_prompt = Template("""
الوثيقة رقم: $doc_num
المحتوى: $chunk_text
""")

footer_prompt = Template("""
استنادًا فقط إلى الوثائق المذكورة أعلاه، قم بإنشاء رد للمستخدم.
الإجابة:
""")
